{
  "backend/main.mo": "Main Motoko actor defining all data types (Student, Teacher, Attendance, Mark, Event, etc.) and backend logic for a school management system, including student creation, attendance, marks, events, semesters, complaints, and role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (login page, teacher dashboard, student dashboard) to their source files, UI components, and test requirement IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing short descriptions of four frontend files: DashboardLayout, ComplaintBoxSection, index.css, and tailwind.config.js.",
  "frontend/index.css": "Global stylesheet with Tailwind directives and OKLCH-based shadcn/ui CSS custom properties for light and dark color themes including sidebar and chart tokens.",
  "frontend/index.html": "Minimal HTML entry point for the React app titled 'School Management App' that mounts the app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with three routes: login (/), teacher dashboard (/teacher/dashboard), and student dashboard (/student/dashboard).",
  "frontend/src/components/layout/DashboardLayout.tsx": "Reusable dashboard shell component featuring a collapsible navy sidebar with logo, role badge, navigation items, and logout button, plus a main content area for both teacher and student roles.",
  "frontend/src/components/student/ComplaintBoxSection.tsx": "Student-facing complaint submission form with a textarea, character counter, validation (minimum 10 characters), and success/error feedback using the useSubmitComplaint mutation hook.",
  "frontend/src/components/student/MyAttendanceSection.tsx": "Displays a student's attendance records with summary cards showing total days, present/absent counts, an attendance rate progress bar, and a detailed records table fetched via the student's principal.",
  "frontend/src/components/student/MyMarksSection.tsx": "Shows a student's marks grouped by semester, displaying each subject's score, percentage, and letter grade (A+ through F) in styled cards fetched via the student's principal.",
  "frontend/src/components/student/MySemesterResultsSection.tsx": "Displays a student's semester exam results grouped by semester, showing per-subject scores and an overall percentage/grade calculated from aggregated scores.",
  "frontend/src/components/student/StudentEventsSection.tsx": "Fetches and displays all school events split into upcoming and past sections, each rendered as a date-card with title, description, and formatted date.",
  "frontend/src/components/teacher/AttendanceSection.tsx": "Provides a teacher form to add or update student attendance records (student, date, present/absent), and displays all attendance records in a table with success/error feedback.",
  "frontend/src/components/teacher/ComplaintsSection.tsx": "Fetches and displays all student-submitted complaints sorted by timestamp, showing the student's name, submission time, and message in a card list.",
  "frontend/src/components/teacher/EventsSection.tsx": "Teacher UI component for creating, editing, and deleting school events, with a form and a list of existing events using CRUD mutation hooks.",
  "frontend/src/components/teacher/MarksSection.tsx": "Teacher UI component for entering and updating student marks by subject and semester, displaying all marks with grade calculations.",
  "frontend/src/components/teacher/SemestersSection.tsx": "Teacher UI component for adding semesters and recording semester exam results per student, with two separate forms and a list of existing semesters.",
  "frontend/src/components/teacher/StudentsSection.tsx": "Teacher UI component for creating new student accounts with name, username, and password, and displaying a list of all students.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Zustand store managing client-side auth state with teacher/student roles and helpers to set or clear the current user session.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and persisting identity across page reloads via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor calls including CRUD operations for students, attendance, marks, events, semesters, complaints, and authentication.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS and defines OKLCH-based CSS custom properties for light and dark theme tokens including sidebar, chart, and semantic UI colors.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LoginPage.tsx": "Login page with tabs for teacher (Internet Identity) and student (username/password) authentication, handling role-based navigation after successful login.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard page that renders role-gated section components (attendance, marks, events, results, complaints) via a shared DashboardLayout with sidebar navigation.",
  "frontend/src/pages/TeacherDashboard.tsx": "Teacher dashboard page that renders role-gated section components (students, attendance, marks, events, semesters, complaints) via a shared DashboardLayout with sidebar navigation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL query parameters from both regular and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with shadcn/ui semantic color tokens using oklch, school-specific colors (navy, gold, bg), custom border radius, fonts, and accordion keyframe animations. Includes typography, container-queries, and tailwindcss-animate plugins.",
  "project_state.json": "Project state descriptor (version 3) summarizing the school management app's architecture, roles (teacher with full CRUD, student with read-only), existing features, known issues, and image requirements."
}