{
  "kind": "build_request",
  "title": "School Management App with Teacher & Student Roles",
  "projectName": "SchoolHub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a backend data model and actor with the following entities: Teacher (id, username, passwordHash), Student (id, name, username, passwordHash), Attendance (studentId, date, status: present/absent), Mark (studentId, subject, score, maxScore, semester), Event (id, title, description, date), Semester (id, name, startDate, endDate), SemesterExamResult (studentId, semesterId, subject, score, maxScore), Complaint (id, studentId, message, timestamp). Store all entities in stable variables.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "attends and marks and events and semester exams",
          "adding semester",
          "compaint box"
        ]
      },
      "acceptanceCriteria": [
        "All data types are defined and stored in stable variables in main.mo",
        "Data persists across canister upgrades"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement teacher authentication: a pre-seeded teacher account (username: 'teacher', password: 'teacher123') that can log in and receive a session token. Expose login and logout functions on the backend.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "give it a login option to enter the app only for teacher only"
        ]
      },
      "acceptanceCriteria": [
        "Teacher can log in with correct credentials and receive a valid session",
        "Invalid credentials return an error",
        "Teacher session grants full admin access"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement student account creation by the teacher: the teacher can create new student accounts with a name, username, and password. Students can then log in with those credentials. Expose createStudent, studentLogin, and studentLogout functions on the backend.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "create new login for students"
        ]
      },
      "acceptanceCriteria": [
        "Teacher can create a new student account",
        "Student can log in with the created credentials",
        "Student session only grants access to their own data"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement backend functions for attendance management: addAttendance (teacher only), updateAttendance (teacher only), getAttendanceByStudent (accessible by teacher for any student, and by the student for their own record), getAttendanceAll (teacher only).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "attends",
          "give access to me to all of it"
        ]
      },
      "acceptanceCriteria": [
        "Teacher can add and update attendance records",
        "Student can only view their own attendance",
        "Unauthorized access returns an error"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement backend functions for marks management: addMark (teacher only), updateMark (teacher only), getMarksByStudent (teacher for all, student for own), getAllMarks (teacher only).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "marks",
          "name's marks entering"
        ]
      },
      "acceptanceCriteria": [
        "Teacher can add and edit marks for any student",
        "Student can only view their own marks",
        "Marks are associated with a subject and semester"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement backend functions for events management: createEvent (teacher only), updateEvent (teacher only), deleteEvent (teacher only), getAllEvents (accessible by both teacher and students).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "events"
        ]
      },
      "acceptanceCriteria": [
        "Teacher can create, update, and delete events",
        "All logged-in users can view events"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement backend functions for semester and semester exam results management: addSemester (teacher only), getSemesters (all authenticated users), addSemesterExamResult (teacher only), getSemesterExamResultsByStudent (teacher for all, student for own).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "semester exams",
          "adding semester"
        ]
      },
      "acceptanceCriteria": [
        "Teacher can add semesters and exam results",
        "Students can view their own semester exam results",
        "Results are linked to a semester and student"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Implement backend functions for the student complaint box: submitComplaint (student only, submits a complaint message associated with their studentId), getAllComplaints (teacher only, returns all complaints with student name and timestamp).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "compaint box",
          "give only access see to marks and attendance events and semester"
        ]
      },
      "acceptanceCriteria": [
        "Students can submit a complaint",
        "Teacher can view all submitted complaints with student name and timestamp",
        "Students cannot view other students' complaints"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Build a login page as the app entry point. It should have two login forms: one for the teacher and one for students. After successful login, redirect to the appropriate dashboard based on role. Include a 'Sign in as Teacher' and 'Sign in as Student' tab or toggle.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "give it a login option to enter the app",
          "only for teacher only",
          "create new login for students"
        ]
      },
      "acceptanceCriteria": [
        "Login page is shown before any app content",
        "Teacher and student login are clearly separated",
        "Successful login routes to the correct dashboard",
        "Error message is shown for invalid credentials"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Build a Teacher Dashboard with navigation sections: Students, Attendance, Marks, Events, Semesters & Exams, and Complaints. The teacher can: create student accounts; enter and edit attendance per student per date; enter and edit marks per student per subject per semester; create/edit/delete events; add semesters and enter semester exam results per student; view all student complaints.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "give access to me to all of it",
          "name's marks entering and adding semester"
        ]
      },
      "acceptanceCriteria": [
        "All six sections are accessible from a sidebar or tab navigation",
        "Teacher can create new student accounts from the Students section",
        "Attendance, marks, and semester exam results have forms for data entry",
        "Events section allows full CRUD",
        "Complaints section displays all student complaints in a readable list"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Build a Student Dashboard with read-only sections: My Attendance, My Marks, Events, My Semester Results, and Complaint Box. Students can view their own attendance records, marks, upcoming events, and semester exam results. The Complaint Box section has a text input form to submit a complaint.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "give only access see to marks and attendance events and semester",
          "compaint box"
        ]
      },
      "acceptanceCriteria": [
        "All four read-only sections display only the logged-in student's data",
        "Complaint Box allows typing and submitting a complaint message",
        "No edit or delete controls are shown to students",
        "Events section shows all school events"
      ]
    },
    {
      "id": "REQ-12",
      "text": "Apply a clean, professional school-themed visual design across the entire app. Use a color palette of deep navy and white with gold accents, clear sans-serif typography, a structured sidebar layout for dashboards, and card-based content sections. Ensure the design is consistent across teacher and student views.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "Color palette is consistently applied across all pages",
        "Typography is legible and professional",
        "Dashboard layout uses a sidebar for navigation",
        "Cards or panels are used for content sections"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Generate and display a school logo/crest illustration used on the login page and dashboard header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "Logo appears on the login page centered above the login form",
        "Logo appears in the dashboard header/sidebar top",
        "Image is served from frontend/public/assets/generated"
      ]
    }
  ],
  "constraints": [
    "Teacher dashboard must be completely inaccessible to students — role-based access must be enforced on both frontend and backend",
    "Students may only view their own data; they must not be able to access other students' records",
    "All Motoko logic must remain in a single actor in backend/main.mo",
    "Do not use external authentication providers; use a simple username/password system stored in backend state"
  ],
  "nonGoals": [
    "Real-time notifications or WebSocket-based updates",
    "Email or SMS notifications",
    "Internet Identity integration",
    "Mobile app or responsive-only design beyond standard web"
  ],
  "imageRequirements": {
    "required": [
      "Flat illustration of a school crest / shield logo with a book and star motif in navy and gold tones (school-logo.dim_256x256.png)"
    ],
    "edits": []
  }
}